#!/usr/bin/env python
# -*- coding: utf-8 -*-

# for xiaobaods_c
goal = {"打底裤": {"厚薄": ['薄款', '常规', '加绒', '加厚'], "裤长": ['长裤', '短裤', '七分裤/九分裤']},
        "牛仔裤": {"款式": ['哈伦裤', '阔脚裤', '铅笔裤', '连衣裤', '背带裤', '直筒', '灯笼裤', '微喇裤', '工装裤', '垮裤'],
                "裤长": ['长裤', '超短裤', '短裤', '五分裤', '九分裤', '七分裤'], "腰型": ['高腰', '低腰', '中腰'],
                "厚薄": ['超薄', '薄款', '常规', '加厚']}}

# for xiaobaods_w
choice_list = {
    "热搜修饰词": {"table": "bc_searchwords_hotwords", "variable": ("搜索人气", "相关搜索词数", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "热搜品牌词": {"table": "bc_searchwords_hotwords", "variable": ("搜索人气", "相关搜索词数", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "热搜搜索词": {"table": "bc_searchwords_hotwords", "variable": ("搜索人气", "商城点击占比", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "热搜核心词": {"table": "bc_searchwords_hotwords", "variable": ("搜索人气", "相关搜索词数", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "热搜长尾词": {"table": "bc_searchwords_hotwords", "variable": ("搜索人气", "商城点击占比", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "飙升修饰词": {"table": "bc_searchwords_risewords",
              "variable": ("相关搜索词数", "搜索人气", "词均搜索增长幅度", "点击人气", "支付转化率", "直通车参考价")},
    "飙升品牌词": {"table": "bc_searchwords_risewords",
              "variable": ("相关搜索词数", "搜索人气", "词均搜索增长幅度", "点击人气", "支付转化率", "直通车参考价")},
    "飙升搜索词": {"table": "bc_searchwords_risewords", "variable": ("搜索增长幅度", "搜索人气", "点击率", "点击人气", "支付转化率", "直通车参考价")},
    "飙升核心词": {"table": "bc_searchwords_risewords",
              "variable": ("相关搜索词数", "搜索人气", "词均搜索增长幅度", "点击人气", "支付转化率", "直通车参考价")},
    "飙升长尾词": {"table": "bc_searchwords_risewords", "variable": ("搜索增长幅度", "搜索人气", "点击率", "点击人气", "支付转化率", "直通车参考价")}, }